// Lookup table générée automatiquement (centrée sur 0)
#ifndef RIPPLE_LOOKUP_TABLE_H
#define RIPPLE_LOOKUP_TABLE_H

#define RIPPLE_LOOKUP_TABLE_SIZE 36

const float ripple_lookup_table[36] = {
    -0.055191,
    -0.035798,
    -0.025352,
    0.002082,
    -0.014123,
    -0.008106,
    -0.040162,
    -0.018397,
    0.013081,
    0.070516,
    0.136797,
    0.132501,
    0.128066,
    0.065955,
    0.002335,
    -0.061418,
    -0.122333,
    -0.120805,
    -0.096582,
    -0.076619,
    -0.052104,
    -0.042103,
    -0.037127,
    -0.042998,
    -0.054632,
    -0.028348,
    -0.017187,
    0.059771,
    0.132680,
    0.148779,
    0.160927,
    0.064875,
    0.026830,
    -0.041785,
    -0.064430,
    -0.089594
};

#endif // RIPPLE_LOOKUP_TABLE_H
